
import time

obr = {
'UTD': 'УПД',
'TORG12': 'ТОРГ-12',
'OFFER': 'Счёт',
'VAT_INVOICE': 'Счёт-фактура',
'CERTIFICATE': 'Акт',
'RECEIPT': 'Чек',
'TTN': 'ТТН',
'DELIVERY_ORDER': 'Накладная',
'NONSTANDARD': 'Нестандартный',
'UNKNOWN': 'Не поддерживается',
'CONTRACT': 'Договор',
'CONTRACT_ATTACHMENT': 'Приложение к договору',
'SUPPLEMENTARY_AGREEMENT': 'Дополнительное соглашение',
'TORG2': 'ТОРГ-2',
'ORDER': 'Приказ',
'DETAILING_OR_SPECIFICATION': 'Детализация-спецификация',
'AO1': 'Авансовый отчет',
'AGENT_REPORT': 'Отчет агента',
'GTD': 'ГТД',
'RETURN_LETTER': 'Письмо на возврат',
'RECONCILIATION_CERTIFICATE': 'Акт сверки',
'OFFSET_CERTIFICATE': 'Акт зачета'
}

def trans(str):
    try:
        return obr[str]
    except:
        return 'NA'

def company(str):
    str = str\
        .replace('ООО ', '')\
        .replace('ЗАО ', '')\
        .replace('СПАО ', '')\
        .replace('ПАО ', '')\
        .replace('АО ', '')\
        .replace('Индивидуальный предприниматель', 'ИП')\
        .replace('Общество с ограниченной ответственностью ', '')\
        .replace('ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ', '')\
        .replace('Закрытое акционерное общество ', '')\
        .replace('Акционерное общество ', '')\
        .replace('МОСКОВСКИЙ ФИЛИАЛ БИЗНЕС ЦЕНТР СТАНИСЛАВСКИЙ (КИПР) ЛИМИТЕД', 'БИЗНЕС ЦЕНТР СТАНИСЛАВСКИЙ')\
        .replace('ФИЛИАЛ АКЦИОНЕРНОГО ОБЩЕСТВА СТРАХОВАЯ КОМПАНИЯ ПАРИ В ГОРОДЕ НОВОРОССИЙСКЕ', 'ФИЛИАЛ АО СК ПАРИ В г. НОВОРОССИЙСКЕ')\
        .replace('ОБЩЕСТВЕННАЯ ОРГАНИЗАЦИЯ ИРКУТСКАЯ РЕГИОНАЛЬНАЯ АССОЦИАЦИЯ ОФТАЛЬМОЛОГОВ', 'Иркутская Ассоциация офтальмологов')

    if len(str) > 70:
        str = f'СЛИШКОМ ДЛИННОЕ НАЗВАНИЕ ФАЙЛА {int(time.time())}'

    return str